driver-tests/bpelse/assign/AssignNamespacesJBI/test/WithStructuredPart4/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <helloObj xmlns="http://xml.netbeans.org/schema/dataTypes.xsd">
      <ns0:recursive xmlns:ns0="http://xml.netbeans.org/schema/dataTypes.xsd">
        <dat:string xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">WithStructuredPart4</dat:string>
        <dat:Element20 xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd" xmlns:dat4="http://xml.netbeans.org/schema/dataTypes.xsd">dat4:someVal</dat:Element20>
      </ns0:recursive>
    </helloObj>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
