driver-tests/bpelse/correlation/MatchingInstanceTwoCorrJBI/test/pick_pick_correlate_receive_pick_eveHdr/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <helloObj xmlns="http://xml.netbeans.org/schema/dataTypes.xsd">
      <ns0:string xmlns:ns0="http://xml.netbeans.org/schema/dataTypes.xsd">initial val create instance pick  after first pick  second pick  after second pick  correlating receive  after first correlating receive  correlating flow receive  after flow correlating receive  correlating pick receive  after correlating pick initial val create instance pick  after first pick  second pick  after second pick  correlating receive  after first correlating receive  correlating flow receive  after flow correlating receive  correlating pick receive  after  correlating evt handler </ns0:string>
    </helloObj>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
