driver-tests/bpelse/assign/Assign2JBI/test/results/DollarInLiteral/Actual_20080523171344_S.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <ns1:helloObj xmlns:msgns="http://j2ee.netbeans.org/wsdl/DollarInLiteral" xmlns:ns1="http://xml.netbeans.org/schema/dataTypes.xsd">
      <ns1:recursive>
        <ns1:string newAttribute="$ThirdNode"/>
      </ns1:recursive>
      <ns1:string newAttribute="firstNode"/>
      <ns1:string newAttribute="$AttributeForSecondNode_Starts_With_Dollar"/>
    </ns1:helloObj>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
